# DefaultJoinOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType..::..DefaultJoinOption Property
ContinuousRailType Class See Also
---
The default join option between two rails.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RailTypeDefaultJoinOption DefaultJoinOption { get; set; }
```

Visual Basic
---
```text
Public Property DefaultJoinOption As RailTypeDefaultJoinOption
	Get
	Set
```

Visual C++
---
```text
public:
property RailTypeDefaultJoinOption DefaultJoinOption {
	RailTypeDefaultJoinOption get ();
	void set (RailTypeDefaultJoinOption value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace